uhnp/src/Enums/НазначенияШаблоновЭтикетокИЦенников/НазначенияШаблоновЭтикетокИЦенников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НазначенияШаблоновЭтикетокИЦенников</name>
  <enumValues>
    <name>ЭтикеткаДляТоваров</name>
  </enumValues>
  <enumValues>
    <name>ЦенникДляТоваров</name>
  </enumValues>
  <enumValues>
    <name>ЭтикеткаДляСкладскихЯчеек</name>
  </enumValues>
  <enumValues>
    <name>ЭтикеткаДляДоставки</name>
  </enumValues>
  <enumValues>
    <name>ЭтикеткаСерииНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ЭтикеткаУпаковочныхЛистов</name>
  </enumValues>
  <enumValues>
    <name>ЭтикеткаДляАкцизныхМарок</name>
  </enumValues>
  <enumValues>
    <name>ЭтикеткаДляШтрихкодовУпаковок</name>
  </enumValues>
  <enumValues>
    <name>ЭтикеткаОбъектаЭксплуатацииЛента</name>
  </enumValues>
  <enumValues>
    <name>ЭтикеткаОбъектаЭксплуатацииБумага</name>
  </enumValues>
  <enumValues>
    <name>ЭтикеткаУзлаОбъектаЭксплуатацииЛента</name>
  </enumValues>
  <enumValues>
    <name>ЭтикеткаУзлаОбъектаЭксплуатацииБумага</name>
  </enumValues>
  <enumValues>
    <name>ЭтикеткаКодМаркировкиИСМП</name>
  </enumValues>
  <enumValues>
    <name>ЭтикеткаТМЦВЭксплуатацииЛента</name>
  </enumValues>
  <enumValues>
    <name>ЭтикеткаТМЦВЭксплуатацииБумага</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/НазначенияШаблоновЭтикетокИЦенников/ManagerModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора.Добавить(Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаДляТоваров);
	ДанныеВыбора.Добавить(Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЦенникДляТоваров);
	ДанныеВыбора.Добавить(Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаДляСкладскихЯчеек);
	ДанныеВыбора.Добавить(Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаДляДоставки);
	ДанныеВыбора.Добавить(Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаСерииНоменклатуры);
	ДанныеВыбора.Добавить(Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаУпаковочныхЛистов);
	ДанныеВыбора.Добавить(Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаДляАкцизныхМарок);
	ДанныеВыбора.Добавить(Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаДляШтрихкодовУпаковок);
	ДанныеВыбора.Добавить(Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаТМЦВЭксплуатацииЛента);
	ДанныеВыбора.Добавить(Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаТМЦВЭксплуатацииБумага);
	//++ НЕ УТ
	ДанныеВыбора.Добавить(Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаОбъектаЭксплуатацииЛента);
	ДанныеВыбора.Добавить(Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаОбъектаЭксплуатацииБумага);
	//-- НЕ УТ

	//++ НЕ УТКА
	ДанныеВыбора.Добавить(Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаУзлаОбъектаЭксплуатацииЛента);
	ДанныеВыбора.Добавить(Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаУзлаОбъектаЭксплуатацииБумага);
	//-- НЕ УТКА
	
КонецПроцедуры

#КонецОбласти
